FACULTY_CHOICES = [
    ("فیزیک", "فیزیک"),
    ("صنایع", "صنایع"),
    ("کامپیوتر", "کامپیوتر"),
    ("برق", "برق"),
    ("عمران", "عمران"),
    ("مواد", "مواد"),
    ("مهندسی شیمی و نفت", "مهندسی شیمی و نفت"),
    ("ریاضی", "ریاضی"),
    ("هوافضا", "هوافضا"),
    ("انرژی", "انرژی"),
    ("مدیریت و اقتصاد", "مدیریت و اقتصاد"),
    ("شیمی", "شیمی"),
    ("مکانیک", "مکانیک"),
]

DORMITORY_CHOICES = [
    ("احمدی روشن", "احمدی روشن"),
    ("طرشت ۲", "طرشت ۲"),
    ("طرشت ۳", "طرشت ۳"),
    ("خوابگاهی نیستم", "خوابگاهی نیستم"),
]

CAMPAIGN_LABEL_CHOICES = [
    ("مسائل دانشگاهی", "مسائل دانشگاهی"),
]

CAMPAIGN_CATEGORY_CHOICES = CAMPAIGN_LABEL_CHOICES + FACULTY_CHOICES + DORMITORY_CHOICES 

POLL_CATEGORY_CHOICES = CAMPAIGN_CATEGORY_CHOICES + [("شورای عمومی", "شورای عمومی")]

USER_ROLE_CHOICES = [
    ("superadmin", "مدیر کل"),
    ("head", "دبیر شورا"),
    ("center_member", "عضو مرکزی"),
    ("faculty_member", "عضو دانشکده"),
    ("dorm_member", "عضو خوابگاه"),
    ("simple_user", "کاربر عادی"),
] 